---
kind: type
id: T:Autodesk.Revit.DB.Electrical.AreaBasedLoadBoundaryLineData
source: html/52959c6a-9d31-222c-3133-e373047095a9.htm
---
# Autodesk.Revit.DB.Electrical.AreaBasedLoadBoundaryLineData

Wrapper class used to access area based load boundary line related data.

## Syntax (C#)
```csharp
public class AreaBasedLoadBoundaryLineData : IDisposable
```